```
Terraform will perform the following actions:

  # maas_instance.k3s_master[0] must be replaced
-/+ resource "maas_instance" "k3s_master" {
      ~ cpu_count    = 4 -> (known after apply)
      ~ fqdn         = "key-boxer.maas" -> (known after apply)
      ~ hostname     = "key-boxer" -> (known after apply)
      ~ id           = "pgx6as" -> (known after apply)
      ~ ip_addresses = [
          - "192.168.68.254",
        ] -> (known after apply)
      ~ memory       = 65536 -> (known after apply)
      ~ pool         = "default" -> (known after apply)
      ~ tags         = [
          - "64gb",
          - "t630-64gb",
        ] -> (known after apply)
      ~ zone         = "default" -> (known after apply)

      + allocate_params { # forces replacement
          + min_cpu_count = 0
          + min_memory    = 0
          + tags          = [
              + "64gb",
            ]
        }

      # Warning: this block will be marked as sensitive and will
      # not display in UI output after applying this change
      ~ deploy_params { # forces replacement
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }
```
